Autodesk.Revit.DB.Structure.LoadCaseArray
An array that contains load case objects.

Autodesk.Revit.DB.Structure.LoadCaseArray.Insert(Autodesk.Revit.DB.Structure.LoadCase,System.Int32)
System.Int32
Insert the specified load case into the array.
item: The load case to be inserted into the array.
index: The load case will be inserted before this index.
Returns: Returns whether the load case was inserted into the array.

Autodesk.Revit.DB.Structure.LoadCaseArray.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.Structure.LoadCaseArray.ReverseIterator
Autodesk.Revit.DB.Structure.LoadCaseArrayIterator
Retrieve a backward moving iterator to the array.
Returns: Returns a backward moving iterator to the array.

Autodesk.Revit.DB.Structure.LoadCaseArray.ForwardIterator
Autodesk.Revit.DB.Structure.LoadCaseArrayIterator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.Structure.LoadCaseArray.Append(Autodesk.Revit.DB.Structure.LoadCase)
void
Add the load case to the end of the array.
item: The load case to be added.

Autodesk.Revit.DB.Structure.LoadCaseArray.Clear
void
Removes every load case from the array, rendering it empty.

Autodesk.Revit.DB.Structure.LoadCaseArray.Size
System.Int32
get
Returns the number of load cases that are in the array.

Autodesk.Revit.DB.Structure.LoadCaseArray.Item(System.Int32)
Autodesk.Revit.DB.Structure.LoadCase
Gets or sets an load case at a specified index within the array.
index: The index of the load case to be set or retrieved.
Returns: Returns the load case at the specified index.

Autodesk.Revit.DB.Structure.LoadCaseArray.IsEmpty
System.Boolean
get
Test to see if the array is empty.
Remarks: If the array is empty then True will be returned, otherwise False.